tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0938;

boundaryField
{
    walls
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.0938;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0938;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft
    {
        type            cyclic;
        value           uniform 0.0938;
    }
    cycRight
    {
        type            cyclic;
        value           uniform 0.0938;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
